# 头版新闻

作为用户
我希望头版新闻可以提供卡片展示的新闻列表
以便于我快速浏览新闻概要

## 加载新闻列表

* 当用户打开应用之后
* 那么他应该看到新闻列表展示出来
* 而且新闻列表中每条新闻的内容应如下展示：

   |新闻摘要 |新闻图片数量|新闻发表日期|
   |-------------------------------------------------|-----------|-----------|
   |王中王！德约一稳定江山，大满贯稳步追赶或成最终赢家       |3          |下午 16:50|
   |你的南红戒指佩戴正确了吗？不会戴？戳这里找答案！         |3          |上午 10:48|
   |甄嬛传：莞嫔手撕颂芝，开头就充满火药味，颂芝的表现该打满分！|2         |上午 10:47|
   |李姐笑话：结婚这么多年了，你个子多高我还不知道          |3          |星期三 10:44|
   |小县金寨： 两年内为何两次解放，两次易名                |1          |星期三 10:44|
   |FAA系列活动 \| 冠军印记大会暨球迷日活动               |0          |星期二 10:41|
   |路虎又拽了！又一“神车”来袭，一看售价，车友：回归巅峰不是梦|3          |10月27日 10:38|

## 等待新闻列表加载

* 如果新闻加载速度较慢
* 那么用户应该先看到"新闻加载中..."的提示
* 然后他应该看见新闻列表展示出来

## 新闻列表加载出错

* 如果新闻加载过程中出现问题
* 那么用户应该看到"新闻无法加载"的提示
* 而且他应该看到"重试"按钮

## 重新加载新闻列表

* 如果用户已经看到了"重试"按钮
* 而且之前加载过程中的问题已经得到了解决
* 当用户点击"重试"按钮之后
* 那么用户应该看见新闻列表展示出来

## 滚动加载更多新闻

* 如果新闻列表已经展示出来
* 当用户滚动到最后一条新闻时
* 那么更多的新闻应该自动加载
* 而且这些新闻应该附加在新闻列表的最后


